1)1Опис , що програма робить її завдання  та для чого вона потрібна  . Телефонна книга з розширеним функціоналом
2) Подумаємо про архітектуру  використаємо за основу домащнє завдання номер 8 та доповнимо його функціоналом  ( основні класи контакт  , телефонна книга , зміна, програмс цс, можливо щось ще потім добавиться)
4:43
3 ) написання інтерфейсу взаємодіЇ з користувачем
4:44
4 ) робота з  контактами редагування змін , перевірка коректного виводу в разі декількох змін на зміни
4:44
5 ) історія змін контактів   ( скоріш за все через текстовий файл )
4:45
6 ) добвити винятки
4:45
7) провести тестування
4:45
8 ) подумати як оптимізувати код
4:46
9) оптимізувати код, провести ще раз фінальний тест